//---------------------------------------------------------------------------
#ifndef WSInputH
#define WSInputH

extern char KeyConfig[24][64];
extern char JoyConfig[24][64];

//---------------------------------------------------------------------------
// WsInputInit 죠이스틱의 초기화
// 인수 없음
// 반치 int			:정상 종료 0, 이상종료(ABEND)-1
//
// 죠이스틱이 사용 가능한가 검사해, 초기화한다
//---------------------------------------------------------------------------
int __fastcall WsInputInit(void);

//---------------------------------------------------------------------------
// Joystick 죠이스틱, 키보드로부터 키값을 취득한다
// 인수 없음
// 반치 int			WS럭-의 값
//
// 죠이스틱 또는 키보드로부터 입력된 키값을 돌려준다.
// 양쪽 모두 동시에 입력할 경우에서도 유효
//---------------------------------------------------------------------------
int __fastcall Joystick(void);

//---------------------------------------------------------------------------
// KeyDown OnKeyDown 이벤트로부터 키값을 설정한다
// 인수 Key         OnKeyDown 이벤트로 건네받은 가상 키
// 반치없음
//---------------------------------------------------------------------------
void __fastcall WsKeyDown(WORD Key);

//---------------------------------------------------------------------------
// KeyUp OnKeyUp 이벤트로부터 키값을 설정한다
// 인수 Key         OnKeyUp 이벤트로 건네받은 가상 키
// 반치없음
//---------------------------------------------------------------------------
void __fastcall WsKeyUp(WORD Key);

//---------------------------------------------------------------------------
// SetKeyMap 카트리지의 종횡 모드로부터 키 맵을 설정한다
// 인수 Mode         카트리지의 모드 0=옆모드,1=세로 모드
// 반치없음
//---------------------------------------------------------------------------
void __fastcall SetKeyMap(int Mode);

//---------------------------------------------------------------------------
#endif
